      ******************************************************************
      * Author: lea
      * Date: 9/26/2024
      * Purpose: learn
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. lea-program.
       AUTHOR. Leandro_Soto_Miranda.
       INSTALLATION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM lea-program.
